#+title: Parametric Specification Table

#+attr_latex: :float multicolumn :placement [ht]
#+attr_latex: :environment tabularx :width \textwidth :align |l|l|l|X|
#+caption: Parametric specification example
#+label: tbl:param-spec-example
|--------------+-----------+--------------------+----------------------------------------------------------------------|
| Editing type | AppNumber | Rule Name | Persistent Names                                                     |
|--------------+-----------+--------------------+----------------------------------------------------------------------|
| INIT         |         1 | Create-square      |                                                                      |
|--------------+-----------+--------------------+----------------------------------------------------------------------|
| INIT         |         2 | extrude-face       | $PN_{1}$ = {[$1n_{3}$]}                                           |
|--------------+-----------+--------------------+----------------------------------------------------------------------|
| INIT         |         3 | insert-vertex      | $PN_{2}$ = {[$1n_{5}; 2n_{5}$]}                                 |
|--------------+-----------+--------------------+----------------------------------------------------------------------|
| INIT         |         4 | extrude-face       | $PN_{3}$ = {[$1n_{3}; 2n_{6}$]}                                 |
|--------------+-----------+--------------------+----------------------------------------------------------------------|
| INIT         |         5 | face-triangulation | $PN_{4}$ = {$1n_{3}; 2n_{2}$}                                  |
|--------------+-----------+--------------------+----------------------------------------------------------------------|
| INIT         |         6 | collapse-face      | $PN_{5}$ = {$1n_{4}; 2n_{6}; 4n_{6}$}                       |
|--------------+-----------+--------------------+----------------------------------------------------------------------|
| INIT         |         7 | chamfer-corner     | $PN_{6}$ = {$1n_{5}; 2n_{6}; 3n_{0}; 4n_{4}; 6n_{2}$} |
|--------------+-----------+--------------------+----------------------------------------------------------------------|
| INIT         |         8 | colour-face        | $PN_{7}$ = {$1n_{5}; 2n_{5}; 3n_{1}$}                       |
|--------------+-----------+--------------------+----------------------------------------------------------------------|
#+TBLFM: $2=(@#-1)
